[{
        "tip_text": "Prune spring-flowering shrubs immediately after the blooms fade, this will give some time for them to set their flower buds in autum on last year's growth.",
        "tip_ref": "Better Homes & Gardens"
    },
    {
        "tip_text": "Grow your vegetables in a location that gets at least 8 hours of direct sunlight each day. If you have shade in your garden, consider looking into cool-season crops.",
        "tip_ref": "Better Homes & Gardens"
    }, 
    {
        "tip_text": "Testing out your soil can be a good idea! Urban soils sometimes contain contaminants that do not support fruit and veggie-life.",
        "tip_ref": "David Suzuki Foundation"
    }, 
    {
        "tip_text": "Do you have leaves lying around? They can make for great mulch that can provide a protective blanket in the cooler seasons, insulating roots and keeping them cool in the summer. Avoid leaves from roadsides which may be contaminated.",
        "tip_ref": "David Suzuki Foundation"
    }
    , 
    {
        "tip_text": "For each plant, try applying a 2-3 inch layer of mulch around it to not only promote growth, but to reduce weeds as well!",
        "tip_ref": "Miraclegro"
    }
    , 
    {
        "tip_text": "Feed your plants! Remember that plants need not only nutritious soil but plant food. Both are integeral for your plant's wellness.",
        "tip_ref": "Miraclegro"
    }
    , 
    {
        "tip_text": "Do your plants match your growing conditions? Please make sure they do - if your plant needs sun, the make sure it gets sun. If it needs dry soil, don't let it grow in a humid place!",
        "tip_ref": "Miraclegro"
    }
    , 
    {
        "tip_text": "Most outdoor plants need at least 6 hours to grow properly, so don't misjudge the sunlight. Your plants need sunlight to thrive.",
        "tip_ref": "Miraclegro"
    }
    , 
    {
        "tip_text": "Checking the hardiness zone of your area can help determine when you should start planting certain types of plants for them to fluorish. You can usually make a quick search online to find out what your hardiness zone is.",
        "tip_ref": "Avant Garden"
    }
    , 
    {
        "tip_text": "Make sure that the soil you grow your plants on drain well and doesn't stay wet. Otherwise, you may have to deal with wet roots, which can lead to rot.",
        "tip_ref": "The Old Farmer's Almanac"
    }
    , 
    {
        "tip_text": "Does your soil have poor drainage? Try mixing in some sand, perlite, or gypsum.",
        "tip_ref": "Schultz"
    }
    , 
    {
        "tip_text": "Ever thought about what season to plant your sprouts? Coordinate your garden with the seasons and make sure that you plan accordingly.",
        "tip_ref": "The Old Farmer's Almanac"
    }
    , 
    {
        "tip_text": "Do you have heavy soils? Loosen your soil by adding compost, manure, peat moss, vermiculite, gypsum, sand, or greensand.",
        "tip_ref": "Schultz"
    }
    , 
    {
        "tip_text": "Is your soil lacking moisture? You can improve absorption and retainment of moisture by including some manure, peat moss, vermiculite, or greensand.",
        "tip_ref": "Schultz"
    }
    , 
    {
        "tip_text": "Soil lacking nutrients? It may be the time for you to look into mixing in some compost and manure.",
        "tip_ref": "Schultz"
    }
    , 
    {
        "tip_text": "When your soil is too wet or too dry, it's best not to dig in, because that will compact your soil and destroy some of its beneficial qualities.",
        "tip_ref": "Schultz"
    }
    , 
    {
        "tip_text": "Rotate your veggie planting plots every two or more years. This will make sure your soil stays rich with nutrients that every plant needs.",
        "tip_ref": "Bonnie Plants"
    }
]